// احنا هنا عندنا حالتين فقط في التطبيق كله او في الشاشة دي لان التطبيق مكون من شاشة واحدة فقط
// فبالتالي احنا محتاجين نعرف حالتين فقط وهما النمبر بتاع الفريق الاول والنمبر بتاع الفريق التاني
// والحالة الاولي هي ان العداد بيزيد للفريق الاول
// والحالة التانية هي ان العداد بيزيد للفريق التاني
abstract class CounterState {}

class CounterCubitInitial extends CounterState {}

class CounterAIncrementState extends CounterState {}

class CounterBIncrementState extends CounterState {}

// دلوقت احنا حددنا الحالاتين اللي احنا محتاجينهم في التطبيق بتاعنا فهنروح ننشاء الكيوبت بتاعنا ونستخدم الحالات دي فيه




// فبالتالي احنا مش محتاجين نستخدم كلاس عشان نعرف الحالة بتاعتنا لان احنا عندنا حالتين فقط
// فبالتالي احنا ممكن نستخدم انميو عشان نعرف الحالة بتاعتنا
// enum CounterState {
  // teamA,
  // teamB,
// }